student {
  id = 408086
  group = "P3113"
  variant = 74

  tuesday = [
    { time = "09:50-11:20"; subject = "Математический анализ Лекция 1405" },
    { time = "11:30-13:00"; subject = "Математический анализ Практика 1410" },
    { time = "13:30-15:00"; subject = "Алгебра и алгоритмы Лекция 1405" },
    { time = "15:30-17:00"; subject = "Алгебра и алгоритмы Практика 2330" }
  ]

  thursday = [
    { time = "08:10-09:40"; subject = "История российской науки и техники Практика 2326" },
    { time = "13:30-15:00"; subject = "История российской науки и техники Лекция 1404" }
  ]
}